{
  "project": {
    "name": "Bronto",
    "twitter": "bronto_finance",
    "description": "The native concentrated liquidity layer of MegaETH",
    "longDescription": "Bronto Finance is the first real-time metaDEX on MegaETH, offering a seamless trading experience with dynamic fees, protection against impermanent loss and JIT liquidity risks, all powered by the ve(3,3) model.",
    "features": [
      {
        "title": "Concentrated Liquidity Pools",
        "description": "Custom pools inspired by Uniswap v3 and Solidly, optimized for low slippage, high capital efficiency, and protection against impermanent loss and JIT attacks."
      },
      {
        "title": "ve(3,3) Governance",
        "description": "Lock tokens for voting power, direct emissions, and earn trading fees and protocol rewards"
      },
      {
        "title": "Dynamic Fees",
        "description": " Real-time fee adjustments based on volatility and volume to boost LP profitability and improve trade execution."
      },
      {
        "title": "Ultra-Fast Trading",
        "description": "Powered by MegaETH for lightning-fast trades, seamless execution, and intuitive features like one-click rebalancing."
      },
      {
        "title": "Permissionless Market Creation",
        "description": "Anyone can launch new trading pairs and liquidity pools that are open, fast, and fully decentralized."
      }
    ],
    "currentStatus": "Swap, voting, liquidity adding/removal, and one-step rebalancer are live, with dynamic fees and impermanent loss protection coming soon."
  },
  "guide": {
    "sections": [
      {
        "id": "swap-tokens",
        "title": "Swap Tokens",
        "steps": [
          {
            "id": "step-1",
            "title": "About Swapping",
            "content": "Bronto Finance offers real-time trade settlement and intuitive trading charts to make data-backed decisions, with customizable slippage and transaction deadlines for a personalized trading experience.",
            "completable": false,
            "images": [],
            "links": []
          },
          {
            "id": "step-2",
            "title": "Try it yourself",
            "content": "1. Connect Your Wallet: Visit Bronto Finance, click \"Connect Wallet\", and select your preferred wallet (e.g., MetaMask).\n\n2.Select Tokens: Choose the tokens you want to swap in the dropdown menus.\n\n3.Set Amount & Customize: Enter the amount, adjust slippage tolerance, set transaction deadlines or use defaults, and review trade details.\n\n4. Execute Swap: Click \"Swap\" and confirm the transaction in your wallet.",
            "completable": true,
            "images": [
              {
                "url": "https://mega-eco.b-cdn.net/bronto_finance/1.png",
                "alt": "Bronto Finance connect wallet"
              }
            ],
            "links": [
              {
                "text": "Swap Tokens",
                "url": "https://bronto.finance/swap"
              }
            ]
          }
        ]
      },
      {
        "id": "manage-liquidity-and-positions",
        "title": "Manage Liquidity and Positions",
        "steps": [
          {
            "id": "step-3",
            "title": "About Liquidity",
            "content": "Bronto Finance lets you manage liquidity and positions with real-time updates",
            "completable": false,
            "images": [],
            "links": []
          },
          {
            "id": "step-4",
            "title": "Try it yourself",
            "content": "1. Navigate to pools tab and select a liquidity pool to provide the liquidity to.\n\n2. Add Liquidity: Use default settings for a quick deposit or switch to Pro Mode to customize price or tick ranges, fee tiers, and track key details.\n\n3. Track Positions: Head to the Positions tab to monitor your LPs, view earnings, and check if any are out of range.\n\n4. Rebalance in One Step: Use the One-Step Rebalancer to automatically withdraw, update ranges, and redeposit your liquidity—all in a single transaction.",
            "completable": true,
            "images": [
              {
                "url": "https://mega-eco.b-cdn.net/bronto_finance/2.png",
                "alt": "Bronto Finance connect wallet"
              }
            ],
            "links": [
              {
                "text": "Manage Liquidity and Positions",
                "url": "https://bronto.finance/pools"
              }
            ]
          }
        ]
      },
      {
        "id": "lock-tokens",
        "title": "Lock",
        "steps": [
          {
            "id": "step-5",
            "title": "About Locking",
            "content": "Bronto Finance lets you lock tokens for up to 4 years, gaining time-based voting power to influence pool rewards and protocol direction.",
            "completable": false,
            "images": [],
            "links": []
          },
          {
            "id": "step-6",
            "title": "Try it yourself",
            "content": "1. Choose amount & Lock Period: Select how many tokens to lock and set a duration (up to 4 years),  longer locks grant more voting power.\n\n2. Lock Tokens: Confirm the lock in your wallet to receive time-weighted voting power.\n\n3. Vote on Pools: Use your voting power to support pools you believe in and help direct future emissions.",
            "completable": true,
            "images": [
              {
                "url": "https://mega-eco.b-cdn.net/bronto_finance/3.png",
                "alt": "Bronto Finance connect wallet"
              }
            ],
            "links": [
              {
                "text": "Lock Tokens",
                "url": "https://bronto.finance/lock"
              }
            ]
          }
        ]
      },
      {
        "id": "vote-on-pools",
        "title": "Vote",
        "steps": [
          {
            "id": "step-7",
            "title": "Try it yourself",
            "content": "1. Allocate Votes: Distribute your veBRONTO voting power to the pools you wish to support. Your votes influence the allocation of emissions and can attract more liquidity to those pools.\n\n2. Earn Rewards: By voting, you earn a share of trading fees and any additional incentives attached to the pools you've supported.\n\n3. Review Emission Schedule: Stay informed about the emissions schedule and phases by visiting the Weekly Emission Schedule",
            "completable": true,
            "images": [
              {
                "url": "https://mega-eco.b-cdn.net/bronto_finance/4.png",
                "alt": "Bronto Finance connect wallet"
              }
            ],
            "links": [
              {
                "text": "Go Vote",
                "url": "https://bronto.finance/vote"
              },
              {
                "text": "Weekly Emission Schedule",
                "url": "https://bronto.finance/docs/emissions"
              }
            ]
          }
        ]
      }
    ],
    "requirements": ["None"],
    "lastUpdated": "2025-05-10"
  }
}
