{
  "project": {
    "name": "Gasyard",
    "twitter": "gasyardfi",
    "description": "Intent-based, cross-VM bridge enabling fast, seamless asset transfers across EVM, Solana & more.",
    "longDescription": "Gasyard is a cross-chain payment and bridge protocol designed to make asset transfers across multiple blockchains fast, seamless, and simple. Whether you're moving liquidity between EVM chains, Move-based chains, Solana, or even Hyperliquid, Gasyard lets you bridge in under 10 seconds.",
    "features": [
      {
        "title": "Cross-Chain Bridging",
        "description": "Transfer assets between EVM and non-EVM chains in ~10 seconds with low slippage and fair fees."
      },
      {
        "title": "Collateral Credits Clearing (CCC)",
        "description": "Off-chain settlement system between solvers while guaranteeing on-chain liquidity for users."
      },
      {
        "title": "Gas On Demand (GOD)",
        "description": "Deposit USDC once and instantly access any supported token on any chain without repeated bridging."
      },
      {
        "title": "Intent-based Architecture",
        "description": "Optimal routing and settlement through solver networks for the best execution."
      }
    ],
    "currentStatus": "Live on multiple chains including MegaETH."
  },
  "guide": {
    "sections": [
      {
        "id": "bridge-assets",
        "title": "Bridge Assets with Gasyard",
        "steps": [
          {
            "id": "step-1",
            "title": "Connect Your Wallet",
            "content": "1. Visit app.gasyard.fi\n2. Click on 'Connect Wallet' in the top right corner\n3. Select your preferred wallet (Metamask, WalletConnect, or others)\n4. Ensure you have enough gas tokens for the source chain transaction",
            "completable": true,
            "images": [],
            "links": [
              {
                "text": "Launch Gasyard",
                "url": "https://app.gasyard.fi"
              }
            ]
          },
          {
            "id": "step-2",
            "title": "Configure Your Bridge",
            "content": "1. Select your source network (the chain you're sending from)\n2. Choose your destination chain\n3. Enter the amount you want to bridge\n4. Select the token you wish to transfer\n5. Review the quote, fees, and destination wallet address",
            "completable": true,
            "images": []
          },
          {
            "id": "step-3",
            "title": "Execute and Track",
            "content": "1. Confirm the transaction to initiate the bridge\n2. Gasyard will route your intent to the best solver\n3. Track your bridge status directly in the app\n4. Use the provided explorer links to verify the transaction on both chains\n5. The transfer typically completes in ~10 seconds",
            "completable": true,
            "images": []
          }
        ]
      },
      {
        "id": "advanced-features",
        "title": "Advanced Features",
        "steps": [
          {
            "id": "step-4",
            "title": "Using Gas On Demand (GOD)",
            "content": "Gas On Demand allows you to:\n• Deposit USDC once and access any supported token on any chain\n• Avoid repeated bridging operations\n• Get real-time liquidity at low fees\n• Perfect for power users, AI agents, and dApps requiring instant liquidity",
            "completable": false
          },
          {
            "id": "step-5",
            "title": "Understanding CCC System",
            "content": "The Collateral Credits Clearing system works as follows:\n• Users lock assets in the source chain\n• Solvers mint Credits on the destination chain (1:1 USDC backing)\n• Credits can be converted back to USDC by solvers\n• System ensures rapid settlement with reduced on-chain costs",
            "completable": false
          }
        ]
      }
    ],
    "requirements": [
      "Gas tokens for source chain transactions",
      "Supported tokens for bridging"
    ],
    "lastUpdated": "2025-04-10"
  }
}
