{
  "project": {
    "name": "GTE",
    "twitter": "GTE_XYZ",
    "description": "The world's fastest decentralized trading venue, built on MegaETH.",
    "longDescription": "GTE is the world's fastest decentralized trading venue, built on MegaETH. Our solution is a fully vertically integrated product suite that delivers an optimal trading experience across each stage of a token's lifecycle.",
    "features": [
      {
        "title": "Crankless Onchain CLOB",
        "description": "Providing CEX-level liquidity and price discovery for spot and perpetuals trading."
      },
      {
        "title": "Classic AMM",
        "description": "For passive liquidity provisioning on long-tail assets."
      },
      {
        "title": "Best-Price Aggregator",
        "description": "Across our AMM, CLOB, and the entire MegaETH ecosystem, ensuring GTE's traders are always getting the best price."
      },
      {
        "title": "Permissionless Token Launcher",
        "description": "Utilizing a bonding curve to bootstrap liquidity into the GTE AMM."
      },
      {
        "title": "Token Launchpad",
        "description": "For larger protocols seeking a takeoff venue for their TGE."
      }
    ],
    "currentStatus": "Takeoff, the GTE permissionless token launcher, the bonding curve, and the AMM are part of our initial testnet launch. CLOB and Perps coming soon."
  },
  "guide": {
    "sections": [
      {
        "id": "launch-token",
        "title": "Launch a token (via Takeoff)",
        "steps": [
          {
            "id": "step-1",
            "title": "Token Distribution Model",
            "content": "Consider the following:\n\n• 80% of each token's supply is set aside to be sold on the bonding curve\n• The remaining 20% is reserved to see the token's AMM pool in case of it bonding\n• Tokens bond once all of the 80% of supply on the bonding curve is sold out\n• Once bonded, tokens will start trading on their respective AMM pool immediately. Long migration periods are a thing of the past.",
            "completable": false,
            "images": [
              {
                "url": "https://mega-eco.b-cdn.net/GTE_XYZ/1.png"
              },
              {
                "url": "https://mega-eco.b-cdn.net/GTE_XYZ/2.png"
              }
            ]
          },
          {
            "id": "step-2",
            "title": "Trade Your Token",
            "content": "Once your token is launched, you can start trading immediately on GTE's swap interface.",
            "completable": true,
            "images": [
              {
                "url": "https://mega-eco.b-cdn.net/GTE_XYZ/3.png"
              }
            ]
          }
        ]
      },
      {
        "id": "earn",
        "title": "Earn",
        "steps": [
          {
            "id": "step-3",
            "title": "Provide Liquidity",
            "content": "• When you provide liquidity to a pool, you earn fees from every trade executed within it\n• The GTE AMM uses a constant-product model, meaning you'll deposit equal amounts of each token into the pool, maintaining a balanced 50/50 ratio\n• In the future, more mature tokens will be traded in GTE's fully on-chain CLOB",
            "completable": true,
            "images": [
              {
                "url": "https://mega-eco.b-cdn.net/GTE_XYZ/4.png"
              },
              {
                "url": "https://mega-eco.b-cdn.net/GTE_XYZ/5.png"
              }
            ]
          }
        ]
      }
    ],
    "requirements": ["None"],
    "lastUpdated": "2025-03-21"
  }
}
