{
  "project": {
    "name": "Noise",
    "twitter": "noise_xyz",
    "description": "A platform to trade trends, turning mindshare into its own market.",
    "longDescription": "Noise is a platform to trade trends. It turns mindshare into its own market, letting users engage with global attention on ideas, brands, and projects. The current testnet V1 is limited to Pre-TGE crypto projects. Throughout testnet and mainnet, Noise will evolve to make trading trends more friendly and intuitive. Future updates will sharpen the mechanics, introduce more markets to gauge attention, and push the boundaries of how the world shapes culture.",
    "features": [
      {
        "title": "Real-time Price Streaming",
        "description": "Prices are streamed directly from Kaito and update every second."
      },
      {
        "title": "Mindshare Markets",
        "description": "Markets on Noise are priced in Mindshare, reflecting popularity of verticals, narratives, and brands."
      }
    ],
    "currentStatus": "Testnet V1 is currently limited to Pre-TGE crypto projects. Future updates will expand to more markets and refine trading mechanics."
  },
  "guide": {
    "sections": [
      {
        "id": "get-started",
        "title": "Get Started with Noise",
        "steps": [
          {
            "id": "step-1",
            "title": "Get Your Access Code",
            "content": "To access Noise, you'll need a specific code that should have been sent to you on Telegram. This code is required to enter the platform.",
            "completable": true,
            "images": []
          },
          {
            "id": "step-2",
            "title": "Access the Platform",
            "content": "Visit https://app.noise.xyz/pages/discover and enter your access code to get started.",
            "completable": true,
            "images": [],
            "links": [
              {
                "text": "Visit Noise",
                "url": "https://app.noise.xyz/pages/discover"
              }
            ]
          },
          {
            "id": "step-3",
            "title": "Understanding Mindshare",
            "content": "Noise uses Mindshare as its pricing mechanism. This represents the popularity and attention of various verticals, narratives, or brands in the market. The higher the mindshare, the more attention that particular trend is receiving.",
            "completable": false,
            "images": []
          }
        ]
      },
      {
        "id": "trading",
        "title": "Trading on Noise",
        "steps": [
          {
            "id": "step-5",
            "title": "Monitor Real-time Prices",
            "content": "• Prices are streamed directly from Kaito\n• Updates occur every second\n• This ensures you always have the most current market data\n• Monitor trends and make informed trading decisions based on real-time mindshare changes",
            "completable": false,
            "images": [
              {
                "url": "https://mega-eco.b-cdn.net/noise_xyz/1.png"
              }
            ]
          },
          {
            "id": "step-6",
            "title": "Place Your First Trade",
            "content": "Select a trend you want to trade, review the current mindshare value, and place your trade. Remember that mindshare reflects the current attention and popularity of the trend.",
            "completable": true,
            "images": [
              {
                "url": "https://mega-eco.b-cdn.net/noise_xyz/2.png"
              },
              {
                "url": "https://mega-eco.b-cdn.net/noise_xyz/3.png"
              }
            ]
          }
        ]
      }
    ],
    "requirements": ["Special access code"],
    "lastUpdated": "2025-03-21"
  }
}
